app/Http/Controllers/CategoryController.php

select * from `categories` order by `order` desc
---
	public static function index()
	{
		$categories = DB::table('categories')
							->orderBy('order','DESC')
							->get();