app/Http/Controllers/CommentController.php

    public function addComment(Request $request)
    {
    	try{
	        //$post = Post::findOrFail($request->post_id);
	        $comment = new Comment;
	        $comment->body = $request->input('body');
	        $comment->user_id = $request->input('user');
	        $comment->post_id = $request->input('post');
	        $comment->save();

	        $user = User::find($comment->user_id);
---
select * from `users` where `users`.`id` in (4)

	public static function commentsPost($idPost)
	{ //SELECT * FROM `comments` INNER JOIN `users` ON `comments`.`user_id`=`users`.`id` WHERE `post_id` = 6
        $comments=Comment::where('post_id', $idPost)->get();
---
select * from `comments` where `post_id` = 3