app/Http/Controllers/PostController.php

select * from `posts` where `category_id` = 3
---
        public static function similars($id, $name, $post){
            $posts=Post::where('category_id',$id)->get();