app/Http/Controllers/PostController.php

select `title`, `posts`.`image`, `posts`.`slug`, `categories`.`image` as `ctgimage` from `posts` inner join `categories` on `categories`.`id` = `posts`.`category_id` limit 8 offset 0
select count(*) as aggregate from `posts` inner join `categories` on `categories`.`id` = `posts`.`category_id`
---
		public static function index()
		{
			$posts = Post::join('categories', 'categories.id', '=','posts.category_id')
							->select('title', 'posts.image', 'posts.slug', 'posts.body', 'categories.image as ctgimage')
							->paginate(8);

select * from `posts` where `slug` = 'html-theme' limit 1
---
        public function show($slug)
		{
			$post = Post::where('slug', $slug)->firstOrFail();

select * from `posts` where `category_id` = 2
---
        public static function similars($id,$name,$post){
            $posts=Post::where('category_id',$id)->get();