app/Http/Controllers/ProfileController.php

    public function show()
    {
        $posts=Post::where('author_id',Auth::user()->id)->paginate(8);
---
select * from `posts` where `author_id` = 1 limit 8 offset 0
select count(*) as aggregate from `posts` where `author_id` = 1